app/controllers/stocks_controller.rb

INSERT INTO "stocks" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Microsoft"], ["created_at", "2024-10-21 10:01:23.580646"], ["updated_at", "2024-10-21 10:01:23.580646"]]
---
    def create
        stock = Stock.new(stock_params)

        if stock.save