app/controllers/teams_controller.rb

    def  create
        team = Team.new(team_params)

        if team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Development Team"], ["created_at", "2024-10-21 10:00:40.487296"], ["updated_at", "2024-10-21 10:00:40.487296"]]