app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("amount", "transaction_type", "source_wallet_id", "target_wallet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["amount", 100.0], ["transaction_type", 0], ["source_wallet_id", nil], ["target_wallet_id", 1], ["created_at", "2024-10-21 10:02:07.379026"], ["updated_at", "2024-10-21 10:02:07.379026"]]
SELECT SUM("transactions"."amount") FROM "transactions" WHERE "transactions"."target_wallet_id" = ?  [["target_wallet_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
      transaction = Transaction.new(transaction_params)

      if transaction.save
        if transaction.credit?
          transaction.target_wallet.update_balance(transaction.amount)
        elsif transaction.debit?
          transaction.source_wallet.update_balance(-transaction.amount)
        end

        transaction.source_wallet.calculate_balance if transaction.source_wallet
        transaction.target_wallet.calculate_balance if transaction.target_wallet

        # Menambahkan informasi nama pengguna
        user_name = transaction.user.name if transaction.user.present?