app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Fajar Dwi Rianto"], ["created_at", "2024-10-21 09:53:36.714636"], ["updated_at", "2024-10-21 09:53:36.714636"]]
---
    def create
        user = User.new(user_params)

        if user.save